app/controllers/attendees_controller.rb

  def index
    @attendees = Attendee.all
---
SELECT "attendees".* FROM "attendees"

  def show
    @attendee = Attendee.find(params[:id])
---
SELECT "attendees".* FROM "attendees" WHERE "attendees"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @attendee = Attendee.find(params[:id])
---
SELECT "attendees".* FROM "attendees" WHERE "attendees"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @attendee = Attendee.new(params[:attendee])

    respond_to do |format|
      if @attendee.save
---
INSERT INTO "attendees" ("address", "bio", "created_at", "latitude", "longitude", "name", "picture", "twitter_handle", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @attendee = Attendee.find(params[:id])

    respond_to do |format|
      if @attendee.update_attributes(params[:attendee])
---
SELECT "attendees".* FROM "attendees" WHERE "attendees"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "attendees" SET "address" = 'Atlanta, GA', "latitude" = 33.7489954, "longitude" = -84.3879824, "updated_at" = '2012-12-01 17:35:38.402865' WHERE "attendees"."id" = 1